app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
  def index
    @cars = Car.search(params[:condition], params[:search])